app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-11-22 22:31:46.908890"], ["id", 1]]
---
  def update
    # byebug
    @article = Article.find(params[:id])
    @article[:title] = params[:article][:title]
    @article[:description] = params[:article][:description]
    @article.save